# StructuralAttachmentStartValueDistance Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..StructuralAttachmentStartValueDistance Property
ParameterTypeId Class See Also
---
"Start Attachment Distance"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId StructuralAttachmentStartValueDistance { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StructuralAttachmentStartValueDistance As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StructuralAttachmentStartValueDistance {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace